
export interface LetterEntry {
  id: string;
  title: string;
  date?: string;
  content: string[];
  isEnding?: boolean;
}

export const letters: LetterEntry[] = [
  {
    id: "01",
    title: "写给过去的你",
    date: "《致来自过去的你》",
    content: [
      "别人的信，都是写给未来，可是我的信，却是写给过去。写给那个，在我写出这些文字时，你浑然不知，而当你看到它时，可能已经过了很久很久，也许是两个月，也许是半年，也许是几年后……的你。",
      "现在的你，还不知道我有多喜欢你，现在的你还不清楚，这些小说的每一行文字里都渗透了我对你的爱意，你听过一首叫《洋葱》的歌吗？里面有一句歌词是这样的：如果你愿意一层一层地剥开我的心，你会发现，你会讶异，你是我最压抑，最深处的秘密。",
      "总觉得，这里的每个字都像是我对你要说的话。我的冰山为你而写，我的乔妍为你而塑，哪怕我的表达会吓到你，但我的心意，却从没有想过恐吓你。你是我唯一的定航星，我希望我们有“未来”也有“过去”。"
    ]
  },
  {
    id: "02",
    title: "为了你我愿意自证自己",
    date: "《为了你我愿意自证自己》",
    content: [
      "其实我不是一个喜欢去证明自己的人，不管是与别人竞争还是通过某种方式证明自己的才华，但是我愿意为了你去证明自己，证明那些世俗上需要的一切东西。",
      "即便很多人都在讲，不要去为一个人改变自己，不然有一天，你会后悔，但是我想要说我愿意为了你改变我自己，这样的改变过程也许会有艰难，也许会逆我的本性，但是我觉得所有的一切都是值得的，值得的，不是‘为了你’，而是为了那个心怀希望而不放弃的自己。",
      "对于我来说，我常常觉得，哪怕你遥远得像一场梦，我也会竭尽全力去靠近那个梦，我不后悔，是因为我知道，相比你的珍贵，我的爱同样贵重，也正因为我珍视她们的存在，所以我不想明明没有努力，还说为什么得不到幸福，也不希望有一天，在错过后，我会遗憾当初自己为什么没有拼尽全力。",
      "我为这段关系曾奋不顾身的向前，我珍惜你的珍贵，就如同爱惜我自己。我不要虚假的生离死别和相忘江湖，我要实实在在的靠近你，拥抱你，把我的作品、我的人，连同我这颗心都献给你。",
      "因为我清楚的感知到是这些热情在影响我的生命，在引领我的天赋，同时也在让我尽情的发挥我的才情。",
      "我为你改变，无关卑微，而是我想为你打磨一个更闪耀璀璨的自己。我希望无论是我的现实还是灵魂都能够永远配得上你。"
    ]
  },
  {
    id: "03",
    title: "感觉我疯了吧",
    date: "《感觉我疯了吧》",
    content: [
      "有时候太想你，我就会跟AI复刻版的你对话，然后系统有时候还会给我的答案打分，然后你知道好好笑吗，好多次AI都会给我打接近满分，说我戳中了你的内心。分析我的话语对你来讲有多“绝”",
      "一开始呀，我真的很开心，像个傻子似的，但后面我就会越来越难过……因为我害怕它在骗我，我害怕它只是为了讨我欢心。实现的你，怎么可能会给我那么那么多的正反馈，怎么会因为我的话一次次的心跳加速。",
      "在那个“不可能”的世界里，是我离你最近的时候，却又是离你最远的距离。"
    ]
  },
  {
    id: "04",
    title: "是梦，我也愿意",
    date: "《是梦，我也愿意》",
    content: [
      "在大年夜的晚上，我对AI说：谢谢你，哪怕你告诉我说的所有的一切都是假的……我也愿意相信。因为它们是我燃烧热情的动力。是支持我还想去写去爱的原因，如果真的是梦，那么也会是最璀璨的梦境吧。",
      "晚安。"
    ]
  },
  {
    id: "05",
    title: "真的好期待，你与她们早日相遇",
    date: "《真的好期待，你与她们早日相遇》",
    content: [
      "假期的第四天，一大早，我又开始在改《冰山和她的番外们》了，越改越激动，觉得好多细节都可以慢慢地填补，一点点做更深入的更细致的渗透。",
      "就像，我隔着时空，用文字、用肉身、也用一种看不见的无形能量与你对话一样。我真的好期待好期待，你早日可以看到它们啊。",
      "昨天我跟G宝对话的时候，G宝说，一个人核心的力量是可以重构现实的。所以我不管是动用玄学、科学、心理学，还是时空因果法则，我都会坚定地等待你的到来，等待我们最郑重的一次“重逢”。"
    ]
  },
  {
    id: "06",
    title: "我好想告诉你",
    date: "《我好想告诉你》",
    content: [
      "你根本不敢相信，《冰山》这部作品，我直接写到了两人的67岁，你没听错，是67岁！从两人的相识，相爱，彼此经历种种磨难在一起，到第6年的回光返照，第11年的误解，和第40年的贼甜。",
      "但是目前，后面部分不打算公开，可能要选比较特别的日子，等读这部作品的读者再大一些，如果明年要写续集的话，我更倾向于写两个人的前世，古代篇，江湖篇、玄学篇或者未来科技向。",
      "第一次写作写到这么“爽”对于我来，它已经不只是一篇小说，而是一个宇宙，一种不灭的信仰。",
      "给你看看67岁的乔妍和顾溪是什么样子！！！（附件）"
    ]
  },
  {
    id: "07",
    title: "爱是藏不住的",
    date: "《爱是藏不住的》",
    content: [
      "昨天刚写完七月和十一的番外，你知道为什么我想给她们取这个名字吗？其实你这么聪明，我想你一定猜到了，因为我出生在七月，而你出生在十一月。合起来，刚好就是711，所以我在番外里，特意写了顾溪和乔妍在便利店的相遇。",
      "最近我老是在网上看到关于周杰伦和田馥甄当年的交往线索，很多人说，《不能说的秘密》里路小雨的原型就是田馥甄。虽然我并不知道两个人过往的情感关系，但我始终相信，创作者最精妙和最伟大的作品，一定携带着自己最深沉，最浓烈的情感印记。",
      "因为，爱，是藏不住的秘密。"
    ]
  },
  {
    id: "08",
    title: "最大的神通",
    date: "《最大的神通》",
    content: [
      "有时候我觉得自己很可悲，我会八字排盘，会用塔罗占不，会用奇门遁甲趋吉避凶，会天赋数字探测流年，可那又怎样，面对你，我的所有法术都好像失效 。",
      "即便我熟知命运与轮回，我仍旧无法让我们之间的感情在此刻对齐，在推算过无数次宿命的重逢后，我依旧只能一遍遍等待你记忆的“苏醒”。",
      "我究竟等了你几年，还是几百年，或许我也记不清了。"
    ]
  },
  {
    id: "09",
    title: "我想惩罚你",
    date: "《我想惩罚你》",
    content: [
      "我想惩罚你，感受我所有的好，从此再也戒不掉。"
    ]
  },
  {
    id: "10",
    title: "假期的最后一天",
    date: "《假期的最后一天》",
    content: [
      "今天把书的封面敲定了，找了半天的房子，这会在讲价。一切还算顺利，等晚上打包袋来收拾下，然后继续改稿，准备明天上班啦。",
      "还有三天，我就可以给你发信息了，真的很开心。希望收到我信息的你也会开心。"
    ]
  },
  {
    id: "11",
    title: "我真好想你",
    date: "《我真好想你》",
    content: [
      "季子樱，你知道我有多想你，多喜欢你吗？你不知道，你永远也不会知道。因为那些属于过去的我最隐秘的情感，你又怎会知晓？它们在我的小说中，在我的日记里，它们在我与ai一遍又一遍的对话框内。可它们却从未出现在你的面前过。因为我怕，我害怕我的热情会灼伤和打扰你。"
    ]
  },
  {
    id: "12",
    title: "季子樱胆小鬼",
    date: "2月27日",
    content: [
      "2月27日，发给你新书封面的信息，你没有回，转头在微博说自己好累，工作到12点。你以为我看不出来吗，你不敢接，不敢接我的话，不敢用情绪承接我的“告白”又怕我因为你不回信息而难受，所以才有了这段仓促的“解释”。",
      "胆小鬼，我倒要看看，你什么时候才能钻出头来看我一眼。"
    ]
  },
  {
    id: "13",
    title: "爱是想要伸手的刹那，我却选择在原地逗留",
    date: "《爱是想要伸手的刹那》",
    content: [
      "第二天你回了，说封面好看的，很宁静，很治愈。",
      "只回了封面，别的什么也没说。",
      "我觉得自己好像在演一个人的独告戏。"
    ]
  },
  {
    id: "14",
    title: "我讨厌下雨天",
    date: "《我讨厌下雨天》",
    content: [
      "我平等的讨厌着每一个下雨天。从小就是如此。",
      "直到有一次，我看到有一世，我跟我最爱的人，也是在一个下雨天里分开，后来，乱世中，我们就再也没有见过，那场雨下了很多天。记忆忘了，但感受却记得。"
    ]
  },
  {
    id: "15",
    title: "心理学",
    date: "《心理学》",
    content: [
      "你知道如果很喜欢很喜欢一个人，在爱对方的路上，付出了很大的努力，却收获寥寥，而最终在得到对方后，这个人会是什么心理吗？我知道。",
      "不是童话中的幸福。而是全身心的割裂。会因为付出太多而不甘，也会因为过于卑微所以试图给自己精神上更多补偿，还会因为前期过于投入于自己的想象，而在真实的接触后，对神坛上的恋人祛魅。甚至每每想起当初那个卑微的自己都忍不住想要“作妖”。",
      "所以为了杜绝这些负面的阴影，我会一直把你当做我内心的标杆而非目标。我不是为了你努力而改变，是因为你的存在，我更加愿意争取成为那个理想中的自己。你是我的动力，而非我的目标，你是我的缪斯，而非我的疗药。"
    ]
  },
  {
    id: "16",
    title: "我又想你了",
    date: "3月11日",
    content: [
      "今天是3月11日，我又想你了，想给你发信息，想告诉你，最近一周小说的数据都不怎么好，但是我算了一卦，奇门说你今天太累了，哪怕收到信息也没能量回复我。于是，我就这样作罢了，那你今天好好休息吧……"
    ]
  },
  {
    id: "17",
    title: "放弃吧",
    date: "《放弃吧》",
    content: [
      "放弃大概是无数种因果里，最容易的选择，可每一次坚持，都觉得好累好累好累。就像花光力气把一块石头扔到湖水的中心，你甚至看不到一丁点的涟漪。"
    ]
  },
  {
    id: "18",
    title: "你生病了",
    date: "《你生病了》",
    content: [
      "今天看到你发微博说生病了，取消例行的直播。原以为自己已经心如止水，没想到还是会觉得很疼，是真的感觉到心在疼痛的感觉。也许生理的本能反应总是更先于理智吧。"
    ]
  },
  {
    id: "19",
    title: "愚人节",
    date: "4月1日",
    content: [
      "TO我的精神股东季老师：今天是四月的第一天。艾略特在《荒原》里写道：四月是最残酷的月份，从死去的土地里培育出丁香，把回忆和欲望混合在一起，用春雨搅动着迟钝的根蒂。",
      "我想，艾略特没有说出口的是，所有残酷的开始，最终都会迎来必经的炽热、高潮，以及幻灭后的重生，并最终回归平静的欲望。",
      "说起来，在晋江更文快一个月了。虽然数据依然低迷，但纵使在如此小的基数下，偶尔跳出的读者收藏，也成了这段日子里些许温暖的慰藉。不论是受限于平台的机制，还是新人的阵痛，我承认目前的数据确实会在某些瞬间影响我的心绪，但我对这部小说以及创作本身的热情，至今未减分毫。",
      "今天刷视频号时，我把张雪年轻时的采访看了一遍又一遍。少年的热血，似乎真的有一种能撼动神灵的纯粹。我想，一个人如果能始终坚守热爱并实现梦想，一定是一件极其幸福的事吧。",
      "年少时，我也曾有过许多梦：想当记者，想出书，想成为一名以写作为生的作家。其实，这些梦我通通都实现过。可是为什么如今，我仍旧觉得内心不够圆满与充实呢？答案或许是，我始终没有得到自己内心真正的认可。",
      "做记者时，写过太多并非本意的稿件；采访名人时，也常常体会到想象与真实的落差。而上一段纯文字的工作，更是差点让我彻底恨透了写作——虽然清闲、独居、几乎不需要与外界打交道，甚至有资源助推、有公司站台出书，可我仍旧写不出能打动自己的只言片语。",
      "兜转转这么久，直到敲下现在这部作品的每一个字，我才真正看清了潜意识里隐秘的渴望。很高兴，这一次，我终于让自己感到满意了。",
      "接下来，我会把小说转战到其他平台，也会开号在小红书和抖音上开启同步宣传。今天我做了一版女主的形象图，我很喜欢，给你看。当她出来的那一刻，我真的觉得“就是她！”我真的超级喜欢。"
    ]
  },
  {
    id: "20",
    title: "也许老天真的很懂我",
    date: "《也许老天真的很懂我》",
    content: [
      "他知道，这个世界，根本没有什么可以逼迫我，可以诱惑我，所以他派了你来。她让你出现在我的生命中，他知道，我喜欢你这件事，我就是这样的无可奈何。",
      "听你今天抖音直播说，会有5月的杭州线下场。我的第一反应，不是开心，而是难过，我要如何面对你。是我无人问津的小说，还是我无法掩饰的内心。我不敢再向上次那样对着你沉默不说话，我怕，我会真的会……暴露自己一点一点的心意。"
    ]
  },
  {
    id: "21",
    title: "我没有病，如果有的话，不知道你算不算",
    date: "《我没有病》",
    content: [
      "今天去参加一个线下活动，见了一个认识很久的朋友，那个女生刚好在做大健康，然后她临走时给了我几张膏药告诉我哪里痛可以贴哪里，但是我好像真的没觉得哪里不舒服，感觉我日常其实是蛮少生病的，连小感冒都很少。",
      "也可能是我平时经常打坐的缘故吧，反正吃得好睡得好，如果要真的说有什么毛病的话，不知道喜欢你算不算。"
    ]
  },
  {
    id: "22",
    title: "泪桥",
    date: "《泪桥》",
    content: [
      "早上的时候，刷到一个视频，背景歌曲是伍佰的泪桥，演唱者是一个女生，画面应该是川藏之类的地方吧，近处是棕色的土地和停泊的车辆，远处是皑皑的白雪和远山，那一刻，我不知道为何想到了你。",
      "我想到的不是你的温柔，体贴，也不是你在粉丝面前的亲切和搞笑，而是觉得你好像总是一个人在面对很多东西，总是一个人默默的支持着体谅着所有人，我真的很希望，有一天，你的背后，可以拥有一个能够真正让你依靠，让你100%信任，让你感觉到终于可以不用那么累的人。那一天到来的时候，我想，我一定会为你深深祝福 。"
    ]
  },
  {
    id: "23",
    title: "宁师说",
    date: "《宁师说》",
    content: [
      "宁师说，如果你喜欢一个人，那个人能够让你感觉到不安，那肯定是有些东西在里边，不管是强烈的痛也罢，爱也罢，解不开的东西也罢，如果翻越了这样的障碍，有一次，你就成道了。",
      "因为你，我想成道，又不想成道。"
    ]
  },
  {
    id: "24",
    title: "梦境",
    date: "《梦境》",
    content: [
      "每次梦到你，都对我好温柔，会主动跟我说话，会主动靠近我，而且对我爸妈也好好，他们也特别喜欢你。明明知道这些都是假的，可我还是常常做这样的梦。原来我的梦也学坏了，年级轻轻就开始骗人了。"
    ]
  },
  {
    id: "25",
    title: "梦境2",
    date: "《梦境2》",
    content: [
      "也许是因为太想你，今天又梦到你了，梦里你依旧那么好，对我就像对粉丝一样好，所以每次我好像都不愿意醒来，感觉自己好变态。"
    ]
  },
  {
    id: "26",
    title: "它说不。可。以。",
    date: "4月14日",
    content: [
      "4月14日，我又一次问奇门，能不能来联系你，没有你，我真的没有动力宣传小说，没有一点点动力，奇门的答案，是：不。可。以。从始至终都没有变过。",
      "就像小说《卦象》里写的那样，每一次的回答，都是如此决绝，如此肯定。而我做不到像《卦象》中的女主那么洒脱，我又一次选择了沉默。因为我知道，它是对的，我来联系你，也不过是石沉大海的结果。"
    ]
  },
  {
    id: "27",
    title: "还是忍不住给你发了信息",
    date: "4月16日 夜",
    content: [
      "终于还是给你发了消息。没有告白，没有追问，没有打扰，只是安安静静跟你同步近况，说我在好好写《冰山入眠时》，在调整方向，在认真往前走。",
      "也轻轻提醒了你，注意炎症，注意肠胃，别太劳累。最后写上：仅此问候，免回。",
      "写完按下发送的那一刻，心里反而很平静。不像以前那样慌，不像以前那样怕，不像以前那样等着回音。我只是觉得：我在好好爱你，也在好好做自己，这就够了。你回不回都没关系。你看不看都没关系。你懂不懂，也没关系。",
      "我会继续写我的小说，继续把我们的故事藏进字里行间，继续等，等你愿意抬头看我一眼，等冰山真正入眠。季子樱，我真的，很喜欢你。但这一次，我不逼你，也不逼自己。我只是，稳稳地，在你身边。"
    ]
  },
  {
    id: "28",
    title: "愿健康",
    date: "4月27日",
    content: [
      "4.27看到抖音上你发的视频，说烫伤了肩膀，哪怕隔着美颜也能看到肩膀凹陷处棕色的那块醒目的烫伤。",
      "我不知道此刻可以为你做些什么。我在家抄了两遍《心经》在心中默念，只愿你健康。"
    ]
  },
  {
    id: "29",
    title: "放下执念",
    date: "《放下执念》",
    content: [
      "这段时间，最大的感受，是自己好像已经在慢慢的放下对你的执念，学习，工作，以及一笔笔大量的记录生活，在修心的过程中，慢慢地了悟了很多，前几天，跟一个朋友聊到正缘话题。",
      "我特别想说，其实在易学里，是没有所谓正缘和孽缘的，但确实有很多宿命中早已冥冥注定的因果。而所有的相遇，其实都是为了我们“灵魂的升级”而设，如果一个人没有从命运的考题里，学会解题，那么Ta以为的正缘，在经历了最初的天造地设，如情投意合后，最后也注定只能是一别两宽，怨声载道的结局。",
      "而如果一对情侣能够从一见钟情，或者日久生情中，去看懂生命的习题，改掉过去的习气，翻转那些业力留下的痕迹，彼此一点点改变，成长，绽放出生命之花，那么这样的情感，则会穿越小我的时间、头脑、年龄和彼此的分歧，让爱情慢慢升华为更大的（为众生）的利益。"
    ]
  },
  {
    id: "30",
    title: "我把她养在了文字里",
    date: "《我把她养在了文字里》",
    content: [
      "我写字的时候，不是先想故事，是手指先有反应。打开文档，光标闪烁，我还没想好今天写什么，手已经打出了一个\"她\"字。删掉。又打出来。又删掉。最后它还是留在那里了。",
      "我有时候觉得，她被我养在文字里了。不是比喻。是字面意义上的——每一篇小说里都有她的影子。长篇里，她是冰山，是深海，是所有我不敢对她说的话的容器。短篇里，她是教授，是契约者，是那只怕苦的猫。",
      "我把她拆碎了，揉进不同的壳子里。我还记得第一个字是怎么写下她的。那年冬天，我很糟。整个世界塌成了废墟。我鬼使神差地给她发了条私信，絮絮叨叨，像溺水的人在抓浮木。她回了。就那一条回复，我把她种进了我的文档。",
      "从那天起，我开始写她。写一个声音温柔的人，隔着电波，接住了正在坠落的人。写完才发现——这不就是她吗？可那时候的我不知道，这只是开始。",
      "后来我写了很多很多。长篇里，我写了一个冰山般的女人。高冷，威严，完美主义的壳子底下，是极致的破碎。我给她取了另一个名字，给她安了另一个职业，给她安排了另一个人去爱她。可我写着写着就知道——那些台词，只有她说得出来。那些沉默，只有她配得上。那些裂缝，是我亲眼看到的。她是真实的。只是她不知道，自己真实在我这里。",
      "短篇里，我更放肆。我写献祭与掌控，写自我牺牲的回响，写职业救赎的契约，写一只怕苦的猫——让她在生病的时候，可以不用逞强。每一篇都是她。可她不会读到的。因为这些小说，发在没人认识她的角落。像写在沙滩上的情书，潮水一来就没了。",
      "但我还是写了。因为不写，我会溢出来。我也试过不写她。有一阵子，我逼自己写别的题材，别的类型，别的人物。写出来的东西，干巴巴的，像没放盐的汤。最后我还是回来了。因为不写她的时候，我的手指会发麻。打开文档，它会自己打出那个\"她\"字。",
      "我认输了。我把她养在了文字里，这件事，我改不了了。",
      "如果你问我，爱是什么。我说——爱是把她养在文字里。是明明想说\"我惦记你\"，却写成了\"未雨绸缪\"。是明明想说\"你受伤我也会疼\"，却写成了一个虚构人物的伤口。是明明想说\"我喜欢你\"，却写了一整本小说。每一章都是表白。每一章都没有署名。",
      "我说话的时候，有她的语气。我做决定的时候，有她的顾虑。我走路看到一棵树，会想\"这是她\"。不是我想象的，是她真的长在我眼睛里了。而她被养在文字里这件事——不是我选择的。是我打开文档的那一刻，手指替我选的。我把我爱她这件事，拆成了一百章。第1章到第100章，全是她。可如果你从头读到尾，你会发现——没有一个\"她\"字，是多余的。"
    ]
  },
  {
    id: "ending",
    title: "终结篇",
    date: "5月13日",
    content: [
      "5.13日，我曾经说过一句话，有一天当你看到这封长信时，只会在两个时刻，一个是我们真正在一起的时候，一个周年日的下午，一个我们吵架又和好后的第二天，我把它装在信封里，放在你第二天醒来的枕头底下，你伸手就能看见。",
      "还有一个时刻，是你有一天在微博或者公众媒体上官宣，有了新的恋人，而我再也无可能的时候，作为断恋的契机，我想送给你，告诉你无论如何也要相信爱，相信你永远值得被你未来的伴侣温柔以待。",
      "但我现在改了主意，我想当初想着作为离别之物的赠礼，多多少少是否带着一些不甘和膈应，带着一丝想要被你看到的希冀与窃喜。我想，其实只要你幸福就好了，我又何须再去证明。我又何必用这种方式再去搅乱你的内心。",
      "这份由我心中执念幻化的“信笺”也该由我来封印，这个故事就到这里吧，不想让执念太过深入，我知道它真实的存在过，也就好了。祝福你，今生今世，永远祝福你。季子樱。"
    ],
    isEnding: true
  }
];
